import matplotlib.pyplot as plt

#Погрешности по 11 точкам
points_lag = [0.0,0.2,0.4,0.6,0.8,1.0,1.2,1.4,1.6,1.8,2.0]
val_lag = [0.00000000, 0.000697, 0.000000, 0.000120, 0.0, 0.000006, 0.0, 0.000080, 0.0, 0.000426, 0.0]
points_cheb = [0.0,0.2,0.4,0.6,0.8,1.0,1.2,1.4,1.6,1.8,2.0]
val_cheb = [0.00016846, 0.00016159, 0.00014566, 0.00011852, 0.00007610, 0.00001723, 0.00001723, 0.00013103, 0.00020087, 0.00025564, 0.00029169]
plt.figure(figsize=(15, 15))
plt.plot(points_lag, val_lag, label = "Погрешности по равнораспределённым узлам", linewidth=3)
plt.plot(points_cheb, val_cheb, label = "Погрешности по узлам Чебышева", linewidth=3)
plt.legend(fontsize=20)
plt.tick_params(axis='x', labelsize=22)
plt.tick_params(axis='y', labelsize=22)
plt.savefig('diff_lag_tab.png')

points_lag = [0.0,0.2,0.4,0.6,0.8,1.0,1.2,1.4,1.6,1.8,2.0]
val_lag = [0.00000000, 0.000697, 0.000000, 0.000120, 0.0, 0.000006, 0.0, 0.000080, 0.0, 0.000426, 0.0]
plt.figure(figsize=(15, 15))
plt.plot(points_lag, val_lag, label = "Погрешности по равнораспределённым узлам", linewidth=3)
plt.legend(fontsize=20)
plt.tick_params(axis='x', labelsize=22)
plt.tick_params(axis='y', labelsize=22)
plt.savefig('diff_just_lag.png')

#Погрешности от узлов
points = [x for x in range (6,50)]
val = [0.00069652, 0.00040093, 0.00005084, 0.00001143, 0.00000119, 0.00000000, 0.00000042, 0.00000113, 0.00000095, 0.00000000, 0.00000393, 0.00000106,
0.00000140, 0.00000000, 0.00000513, 0.00000000, 0.00000973, 0.00000000, 0.00003946, 0.00000000, 0.00000000, 0.00000000, 0.00015026, 0.00016522, 0.00000000,
0.00000000, 0.00000000, 0.00035873, 0.00052506, 0.00000000, 0.00659394, 0.00000000, 0.00385177, 0.00000000, 0.00668406, 0.00000042, 0.00461331, 0.00000000,
0.00000000, 0.10497990, 0.12731791, 0.20816928, 0.14333045, 0.08760166]
points_c = [x for x in range (6,50)]
val_c = [0.00030920, 0.00020292, 0.00002790, 0.00000801, 0.00000173, 0.00000023, 0.00000000, 0.00000013, 0.00000022, 0.00000019, 0.00000012, 0.00000015, 
0.00000010, 0.00000016, 0.00000012, 0.00000009, 0.00000007, 0.00000010, 0.00000016, 0.00000006, 0.00000008, 0.00000005, 0.00000003, 0.00000006, 
0.00000006, 0.00000008, 0.00000004, 0.00000009, 0.00000007, 0.00000006, 0.00000000, 0.00000004, 0.00000006, 0.00000006, 0.00000002, 0.00000005, 
0.00000006, 0.00000003, 0.00000008, 0.00000004, 0.00000006, 0.00000003, 0.00000008, 0.00000003]
plt.figure(figsize=(15, 15))
plt.plot(points, val, label = "Погрешность в зависимости от кол-ва узлов", linewidth=3)
plt.plot(points_c, val_c, label = "Погрешность в зависимости от кол-ва узлов Чебышев", linewidth=3)
plt.legend(fontsize=20)
plt.tick_params(axis='x', labelsize=22)
plt.tick_params(axis='y', labelsize=22)
plt.savefig('differs.png')

points = [x for x in range (6,50)]
val = [0.00069652, 0.00040093, 0.00005084, 0.00001143, 0.00000119, 0.00000000, 0.00000042, 0.00000113, 0.00000095, 0.00000000, 0.00000393, 0.00000106,
0.00000140, 0.00000000, 0.00000513, 0.00000000, 0.00000973, 0.00000000, 0.00003946, 0.00000000, 0.00000000, 0.00000000, 0.00015026, 0.00016522, 0.00000000,
0.00000000, 0.00000000, 0.00035873, 0.00052506, 0.00000000, 0.00659394, 0.00000000, 0.00385177, 0.00000000, 0.00668406, 0.00000042, 0.00461331, 0.00000000,
0.00000000, 0.10497990, 0.12731791, 0.20816928, 0.14333045, 0.08760166]
plt.figure(figsize=(15, 15))
plt.plot(points, val, label = "Погрешность в зависимости от кол-ва узлов", linewidth=3)
plt.legend(fontsize=20)
plt.tick_params(axis='x', labelsize=22)
plt.tick_params(axis='y', labelsize=22)
plt.savefig('differs_not_c.png')

#Табуляция
points_tab = [0.0,0.4,0.8,1.2,1.6,2.0]
val_tab = [0.00000000, 0.42839238, 0.74210095, 0.91031408, 0.97634840, 0.99532264]
plt.figure(figsize=(15, 15))
plt.plot(points_tab, val_tab, label = "Табуляция по 6 узлам", linewidth=3)
plt.legend(fontsize=25)
plt.tick_params(axis='x', labelsize=22)
plt.tick_params(axis='y', labelsize=22)
plt.savefig('tab_6_nodes.png')

#Лагранж
points_lag_2 = [0.0,0.2,0.4,0.6,0.8,1.0,1.2,1.4,1.6,1.8,2.0]
val_lag_2 = [0.00000000, 0.22200607, 0.42839238, 0.60397577, 0.74210095, 0.84269416, 0.91031408, 0.95220494, 0.97634846, 0.98951626, 0.99532264]
plt.figure(figsize=(15, 15))
plt.plot(points_lag_2, val_lag_2, label = "Полином Лагранжа", linewidth=3)
plt.legend(fontsize=25)
plt.tick_params(axis='x', labelsize=22)
plt.tick_params(axis='y', labelsize=22)
plt.savefig('tab_11_nodes.png')